This seems to be a real issue still... so adding comment with details...

`Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_cloudwatch_log_group.bbl will be created
  + resource "aws_cloudwatch_log_group" "bbl" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = (known after apply)
      + name_prefix       = "bbl-env-ur-f3cdb35-log-group"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Name" = "bbl-env-urmia-2023-╷
│ Error: Error in function call
│ 
│   on bbl-template.tf line 394, in resource "aws_subnet" "internal_subnets":
│  394:   cidr_block        = "${cidrsubnet(var.vpc_cidr, 4, count.index+1)}"
│     ├────────────────
│     │ while calling cidrsubnet(prefix, newbits, netnum)
│     │ count.index is 18
│     │ var.vpc_cidr is "10.0.0.0/16"
│ 
│ Call to function "cidrsubnet" failed: prefix extension of 4 does not
│ accommodate a subnet numbered 19.
╵
╷
│ Error: Error in function call
│ 
│   on bbl-template.tf line 394, in resource "aws_subnet" "internal_subnets":
│  394:   cidr_block        = "${cidrsubnet(var.vpc_cidr, 4, count.index+1)}"
│     ├────────────────
│     │ while calling cidrsubnet(prefix, newbits, netnum)
│     │ count.index is 16
│     │ var.vpc_cidr is "10.0.0.0/16"
│ 
│ Call to function "cidrsubnet" failed: prefix extension of 4 does not
│ accommodate a subnet numbered 17.
╵
╷
│ Error: Error in function call
│ 
│   on bbl-template.tf line 394, in resource "aws_subnet" "internal_subnets":
│  394:   cidr_block        = "${cidrsubnet(var.vpc_cidr, 4, count.index+1)}"
│     ├────────────────
│     │ while calling cidrsubnet(prefix, newbits, netnum)
│     │ count.index is 17
│     │ var.vpc_cidr is "10.0.0.0/16"
│ 
│ Call to function "cidrsubnet" failed: prefix extension of 4 does not
│ accommodate a subnet numbered 18.`